# Ввод целого числа
n = int(input("Введите целое число: "))

# Если число положительное, прибавить 1
if n > 0:
    n += 1

# Вывести результат
print(n)